yerraabhilash/Embedded_Projects/STM32_PROJECTS/STM32CubeIDE/stm32f411xx_drivers/drivers/Src/stm32f411cexx_i2c_driver.c
/*
 * stm32f411cexx_i2c_driver.c
 *
 *  Created on: 27-Jan-2026
 *      Author: yerra
 */

#include "stm32f411cexx_i2c_driver.h"



static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx);
static void I2C_ExecuteAddressPhaseWrite(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr);
static void I2C_ExecuteAddressPhaseRead(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr);
static void I2C_ClearADDRFlag(I2C_Handle_t *pI2CHandle);

static void I2C_MasterHandleRXNEInterrupt(I2C_Handle_t *pI2CHandle);
static void I2C_MasterHandleTXEInterrupt(I2C_Handle_t *pI2CHandle);


/***************************************************************
 * @fn            -
 *
 * @brief         -
 *
 * @parm[in]      -
 * @parm[in]      -
 * @parm[in]      -
 *
 * @return        -0 or 1
 *
 * @note          -none
 */
static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx)
{
	//GENERATE THE START CODITON
	pI2Cx->CR1 |= (1 << I2C_CR1_START);
}

/***************************************************************
 * @fn            -
 *
 * @brief         -
 *
 * @parm[in]      -
 * @parm[in]      -
 * @parm[in]      -
 *
 * @return        -0 or 1
 *
 * @note          -none
 */

static void I2C_ExecuteAddressPhaseWrite(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr)
{
	//todo
	SlaveAddr = SlaveAddr << 1;
	SlaveAddr &= ~(1);  // SlaveAddr is Slave address + R/W bit = 0
	pI2Cx->DR = SlaveAddr;
}




static void I2C_ExecuteAddressPhaseRead(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr)
{
	//todo
	SlaveAddr = SlaveAddr << 1;
	SlaveAddr = 1;  // SlaveAddr is Slave address + R/W bit = 1
	pI2Cx->DR = SlaveAddr;
}

static void I2C_ClearADDRFlag(I2C_Handle_t *pI2CHandle)
{
	uint32_t dummy_read;
	//check the device  mode
	if(pI2CHandle->pI2Cx->SR2 & (1 << I2C_SR2_MSL))
	{
		//device is in Master mode
		if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
		{
			if(pI2CHandle->RxSize == 1)
			{
				//First disable the ack
				I2C_ManageAcking(pI2CHandle->pI2Cx, DISABLE);

				//Clear the ADDR flag (Read Sr1 , Read SR2
				dummy_read = pI2CHandle->pI2Cx->SR1;
				dummy_read = pI2CHandle->pI2Cx->SR2;
				(void)dummy_read;

			}

		}else
		{
			//Clear the ADDR flag (Read Sr1 , Read SR2
			dummy_read = pI2CHandle->pI2Cx->SR1;
			dummy_read = pI2CHandle->pI2Cx->SR2;
			(void)dummy_read;

		}

	}else
	{
		//Device is in Slave Mode
		//Clear the ADDR flag (Read Sr1 , Read SR2
		dummy_read = pI2CHandle->pI2Cx->SR1;
		dummy_read = pI2CHandle->pI2Cx->SR2;
		(void)dummy_read;

	}
}



void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= (1 << I2C_CR1_STOP);
}





void I2C_SlaveEnDisCallback(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	//toso
	if(EnorDi == ENABLE)
	{
		pI2Cx->CR2 |= (1 << I2C_CR2_ITEVTEN);
		pI2Cx->CR2 |= (1 << I2C_CR2_ITBUFEN);
		pI2Cx->CR2 |= (1 << I2C_CR2_ITERREN);
	}else
	{
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITEVTEN);
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITBUFEN);
		pI2Cx->CR2 &= ~(1 << I2C_CR2_ITERREN);
	}
}

/***************************************************************
 * @fn            - I2C_peripheralcontrol
 *
 * @brief         -
 *
 * @parm[in]      -
 * @parm[in]      -
 * @parm[in]      -
 *
 * @return        -0 or 1
 *
 * @note          -none
 */
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	//todo
	if(EnorDi == ENABLE){
		pI2Cx->CR1 |= (1 << I2C_CR1_PE);
		//pi2cBaseAddress-> |= I2C_CR1_PE_Bit_Mask
	}else
	{
		pI2Cx -> CR1 &= ~(1 << 0);
	}
}

/***************************************************************
 * @fn            - I2C_peripheralcontrol
 *
 * @brief         -
 *
 * @parm[in]      -
 * @parm[in]      -
 * @parm[in]      -
 *
 * @return        -0 or 1
 *
 * @note          -none
 */
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	//todo
	if(EnorDi == ENABLE){
		  if(pI2Cx == I2C1)
		  {
			  I2C1_PCLK_EN();
		  }else if (pI2Cx == I2C2)
		  {
			  I2C2_PCLK_EN();
		  }else if (pI2Cx == I2C3)
		  {
			  I2C3_PCLK_EN();
		  }
	}else
	{
		//TODO
	}
}

/***************************************************************
 * @fn            -
 *
 * @brief         -
 *
 * @parm[in]      -
 * @parm[in]      -
 * @parm[in]      -
 *
 * @return        -0 or 1
 *
 * @note          -none
 */

uint32_t RCC_GetPLLOutputClk()
{

	return 0;
}




/***************************************************************
 * @fn            - I2C Init
 *
 * @brief         -
 *
 * @parm[in]      -1. Configure the Mode(standard or fast)
 * @parm[in]      -2. Configure the speed of the serial clock (SCL)
 * @parm[in]      -3. Configure the device address (applicable when device is slave)
 * @parm[in]      -4. Enable the Acking
 * @parm[in]      -5. Configure the rise time for I2C pins(will discuss later)
 *                      All the above configuration must be done when the peripheral is disabled in the control register
 * @return        -0 or 1
 *
 * @note          -none
 */
void I2C_Init(I2C_Handle_t *pI2CHandle)
{
	uint32_t tempreg = 0;

	//Enable the clock for the i2cx peripherals
	I2C_PeriClockControl(pI2CHandle->pI2Cx,ENABLE);

	//ack control bit
	tempreg |= pI2CHandle->I2C_Config.I2C_AckControl << 10;
	pI2CHandle->pI2Cx->CR1 = tempreg;

	//configure the FREQfield of CR2
	tempreg = 0;
	tempreg |= RCC_GetPCLK1Value() /1000000U;
	pI2CHandle->pI2Cx->CR2 = (tempreg & 0x3F);

	//program the device own address
	tempreg = 0;
	tempreg |= pI2CHandle->I2C_Config.I2C_DeviceAddress << 1;
	tempreg |= (1 << 14);
	pI2CHandle->pI2Cx->OAR1 = tempreg;


	//CCR Calculation
	uint16_t ccr_value = 0;
	tempreg = 0;
	if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_SM)
	{
		//Mode is Standard mode
		ccr_value = (RCC_GetPCLK1Value() / (2 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
		tempreg |= (ccr_value & 0xFFF);
	}else
	{
		//mode is fast mode
		tempreg |= (1 << 15);
		tempreg |= (pI2CHandle->I2C_Config.I2C_FMDutyCycle << 14);
		if(pI2CHandle->I2C_Config.I2C_FMDutyCycle == I2C_FM_DUTY_2)
		{
			ccr_value = (RCC_GetPCLK1Value() / (3 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
		}else
		{
			ccr_value = (RCC_GetPCLK1Value() / (25 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
		}
		tempreg |= (ccr_value & 0xFFF);
	}
	pI2CHandle->pI2Cx->CCR = tempreg;

	//TRISE CONfiguration
	if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_SM)
	{
		//Mode is Standard mode

		tempreg = (RCC_GetPCLK1Value()  / 1000000U)+ 1;

