yerraabhilash/Embedded_Projects/STM32_PROJECTS/STM32CubeIDE/stm32f411xx_drivers/drivers/Src/stm32f411cexx_i2c_driver.c
	}else
	{
		//mode is fast mode
		tempreg = ((RCC_GetPCLK1Value() * 300) / 1000000000U) + 1;
	}

	pI2CHandle->pI2Cx->TRISE = (tempreg & 0x3F);

}




/***************************************************************
 * @fn            -
 *
 * @brief         -
 *
 * @parm[in]      -
 * @parm[in]      -
 * @parm[in]      -
 *
 * @return        -0 or 1
 *
 * @note          -none
 */
void I2C_DeInit(I2C_RegDef_t *pI2Cx)
{
	//todo
}


uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName)
{
	//TODO
	if(pI2Cx->SR1 & FlagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}


/***************************************************************
 * @fn            SPI_IRQInterrupt configuration
 *
 * @brief         -
 *
 * @parm[in]      -
 * @parm[in]      -
 * @parm[in]
 *
 * @return        -0 or 1
 *
 * @note          -none
 */
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
	//Configure the irq numbers
	if(EnorDi == ENABLE)
	{

		if(IRQNumber <= 31)
		{
			//program ISER0 Register
			*NVIC_ISER0 |=(1 << IRQNumber);
		}
		else if (IRQNumber > 31 && IRQNumber < 64)
		{
			//program ISER1 Register 32 to 63
			*NVIC_ISER1 |=(1 << (IRQNumber % 32));
		}
		else if(IRQNumber >= 64 && IRQNumber < 96)
		{
			//program ISER2 Register 64 to 95
			*NVIC_ISER3 |=(1 << (IRQNumber % 64));
		}
	}else
	{
		if(IRQNumber <= 31)
		{
			//ICER0 Register
			*NVIC_ICER0 |=(1 << IRQNumber);
		}
		else if (IRQNumber > 31 && IRQNumber < 64)
		{
			//ICER1
			*NVIC_ICER1 |=(1 << (IRQNumber % 32));
		}
		else if(IRQNumber >= 64 && IRQNumber < 96)
		{
			//ICER2
			*NVIC_ICER3 |=(1 << (IRQNumber % 64));
		}
	}

}




void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	//priority
	//first find out hte ipr register you can find in Device generic user in arm cortexm4

	uint32_t iprx = IRQNumber / 4;
	uint32_t iprx_selection = IRQNumber % 4;

	uint8_t shift_amount = (8 * iprx_selection) + (8 - NO_PR_BITS_IMPLEMENTED);
	*(NVIC_PR_BASE_ADDR + (iprx)) |= (IRQPriority << shift_amount);
}

/***************************************************************
 * @fn            -
 *
 * @brief         -
 *
 * @parm[in]      -
 * @parm[in]      -
 * @parm[in]      -
 *
 * @return        -0 or 1
 *
 * @note          -none
 */
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t Sr)
{
	//1. Generate the START condition
	I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

	//2. confirm that start generation is completed by checking the SB flag in the SR1 Le
	// Note: Until SB is cleared SCL will be stretched (pulled to LOW)
	while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_SB));

	//3. Send the address of the slave with r/nw bit set to w(0) (total 8 bits)
	I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, SlaveAddr);

	//4. Confirm that address phase is completed by checking the ADDR flag in teh SRI
	while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_ADDR));

	//5. clear the ADDR flag according to its software sequence
    // Note: Until ADDR is cleared sit will be stretched (pulled to LOW)
	I2C_ClearADDRFlag(pI2CHandle);

	//6. send the data until Len becomes 0
	while(Len > 0)
	{
		while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_TXE)); // Wait until TXE is set
		pI2CHandle->pI2Cx->DR = *pTxBuffer;
		pTxBuffer++;
		Len--;
	}

	//7. when Len becomes zero wait for TXE=1 and BTF-1 before generating the STOP condition
	//Note: TXE-1, BTF-1, means that both SR and DR are empty and next transmission should begin
    //when BTF-1 SCL will be stretched (pulled to LOW)
	while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_TXE));

	while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_BTF));

	//8. Generate STOP condition and master need not to wait for the completion of stop condition.
	//Note: generating STOP, automatically clears the BTF
	if(Sr == I2C_DISABLE_SR){
		I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
	}


}



void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint8_t Len, uint8_t SlaveAddr, uint8_t Sr)
{
	//1. Generate the START condition
	I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

	//2. confirm that start generation is completed by checking the SB flag in the SR1
	//Note: Until SB is cleared SCL will be stretched (pulled to LOW)
	while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_SB));

	//3. Send the address of the slave with r/nw bit set to R(1) (total 8 bits )
	I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx, SlaveAddr);

	//4. wait until address phase is completed by checking the ADDR flag in teh SR1
	while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_ADDR));

	//procedure to read only 1 byte from slave
	if(Len == 1){

		//Disable Acking
		I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DESABLE);

		//clear the ADDR flag
		I2C_ClearADDRFlag(pI2CHandle);

		//wait until RXNE becomes 1
		while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_RXNE)); // Wait until RXNE is set

		//generate STOP condition
		if(Sr == I2C_DISABLE_SR){
		    I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
		}

		//read data in to buffeR
		*pRxBuffer = pI2CHandle->pI2Cx->DR;


	}


	//procedure to read data from slave when Len > 1
	 if (Len > 1){

			//clear the ADDR flag
		 I2C_ClearADDRFlag(pI2CHandle);

			//read the data until Len becomes zero
		 for(uint32_t i = Len;i > 0;i--)
		 {
			 //wait until RXNE becomes 1
			 while(! I2C_GetFlagStatus(pI2CHandle->pI2Cx,I2C_FLAG_RXNE)); // Wait until RXNE is set

			 if(i == 2) //if last 2 bytes are remaining
			 {
				 //clear the ack bit
				 I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DESABLE);

				 //Generate  Stop condition
					if(Sr == I2C_DISABLE_SR){
					    I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
					}
			 }

			 //read the data from data register in to buffer
			 *pRxBuffer = pI2CHandle->pI2Cx->DR;

			 //increment the buffer address
			 pRxBuffer++;

